def area(a, b):
    """
    Вычисляет площадь прямоугольника.

    Параметры:
    a (float или int): Длина одной стороны прямоугольника.
    b (float или int): Длина другой стороны прямоугольника.

    Возвращаемое значение:
    float или int: Площадь прямоугольника.
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    Параметры:
    a (float или int): Длина одной стороны прямоугольника.
    b (float или int): Длина другой стороны прямоугольника.

    Возвращаемое значение:
    float или int: Периметр прямоугольника.
    """
    return 2 * (a + b)