def area(a, h):
    """
    Вычисляет площадь треугольника по основанию и высоте.

    Параметры:
    a (float или int): Длина основания треугольника.
    h (float или int): Высота треугольника, опущенная на основание.

    Возвращаемое значение:
    float или int: Площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника по длинам всех сторон.

    Параметры:
    a (float или int): Длина первой стороны треугольника.
    b (float или int): Длина второй стороны треугольника.
    c (float или int): Длина третьей стороны треугольника.

    Возвращаемое значение:
    float или int: Периметр треугольника.
    """
    return a + b + c